# IsValidDirectionForAutoDetect Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsValidDirectionForAutoDetect Method
AnalyticalModel Class See Also
---
Tests if the supplied direction is valid for Analytical Auto-detect.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsValidDirectionForAutoDetect(
	AnalyticalDirection direction
)
```

Visual Basic
---
```text
Public Function IsValidDirectionForAutoDetect ( _
	direction As AnalyticalDirection _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidDirectionForAutoDetect(
	AnalyticalDirection direction
)
```

# ### Parameters
direction
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalDirection Direction in which Auto-detect behavior may be valid.
# ### Return Value
True if direction is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace